#### Initializing Connection

In [ ]:
import mysql.connector as sqltor

connection = sqltor.connect(host="localhost", user="root", password="mysqlpasswd")
cursor = connection.cursor()
cursor.execute("CREATE DATABASE IF NOT EXISTS week2")
cursor.execute("USE week2")

#### Additional Helper functions

In [5]:
def disp():
    print(*[line for line in cursor], sep="\n")


def run(query: str):
    cursor.execute(query)

#### Testing Tables and Databases

In [6]:
run("SHOW DATABASES")
disp()
run("SHOW TABLES")
disp()
# exit()

('information_schema',)
('mysql',)
('performance_schema',)
('sys',)
('week1',)
('week2',)
('department',)
('employee',)
('loc',)

### Queries

1. Create a table employee with attributes emp_id, f_name, l_name, job_type, salary, dept, commission, manager_id.

In [ ]:
run(
    """CREATE TABLE Employee (
				emp_id INT(4),
				f_name VARCHAR(25),
				l_name VARCHAR(25),
				job_type VARCHAR(10),
				salary INT(10),
				dept VARCHAR(10),
				commission INT(10),
				manager_id VARCHAR(5)
			)
"""
)
query1a = "ALTER TABLE Employee DROP PRIMARY KEY"

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     | YES  |     |  NULL   |       |
|     f_name      | varchar(25) | YES  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     | YES  |     |  NULL   |       |
|      dept       | varchar(10) | YES  |     |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

2. Make emp_id as the primary key of employee table.

In [ ]:
run("ALTER TABLE Employee ADD PRIMARY KEY(emp_id)")

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   emp_id   |     int     |  NO  | PRI |  NULL   |       |
|   f_name   | varchar(25) | YES  |     |  NULL   |       |
|   l_name   | varchar(25) | YES  |     |  NULL   |       |
|  job_type  | varchar(10) | YES  |     |  NULL   |       |
|   salary   |     int     | YES  |     |  NULL   |       |
|    dept    | varchar(10) | YES  |     |  NULL   |       |
| commission |     int     | YES  |     |  NULL   |       |
| manager_id | varchar(5)  | YES  |     |  NULL   |       |

3. Make f_name and salary NOT NULL type.

In [ ]:
run(
    """ALTER TABLE Employee 
				MODIFY f_name VARCHAR(25) NOT NULL,
				MODIFY salary INT(10) NOT NULL
"""
)

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   emp_id   |     int     |  NO  | PRI |  NULL   |       |
|   f_name   | varchar(25) |  NO  |     |  NULL   |       |
|   l_name   | varchar(25) | YES  |     |  NULL   |       |
|  job_type  | varchar(10) | YES  |     |  NULL   |       |
|   salary   |     int     |  NO  |     |  NULL   |       |
|    dept    | varchar(10) | YES  |     |  NULL   |       |
| commission |     int     | YES  |     |  NULL   |       |
| manager_id | varchar(5)  | YES  |     |  NULL   |       |

4. Add a column date_of_joining in the employee table.

In [ ]:
run("""ALTER TABLE Employee ADD date_of_joining DATE""")

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     |  NO  | PRI |  NULL   |       |
|     f_name      | varchar(25) |  NO  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     |  NO  |     |  NULL   |       |
|      dept       | varchar(10) | YES  |     |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

5. Create a table department with attribute d_name, d_loc and HOD_id where d_name is primary key.

In [ ]:
run(
    """CREATE TABLE Department (
				d_name VARCHAR(10) PRIMARY KEY,
				d_loc VARCHAR(10),
				HOD_id VARCHAR(10)
			)
"""
)

| Field  |    Type     | Null | Key | Default | Extra |
| :----: | :---------: | :--: | :-: | :-----: | :---: |
| d_name | varchar(10) |  NO  | PRI |  NULL   |       |
| d_loc  | varchar(10) | YES  |     |  NULL   |       |
| HOD_id | varchar(10) | YES  |     |  NULL   |       |

6. Create a table location with attributes loc_id, city and contact_no.

In [ ]:
run(
    """CREATE TABLE Location (
				loc_id VARCHAR(10),
				city VARCHAR(20),
				contact_no INT(12)
			)
"""
)

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   loc_id   | varchar(10) | YES  |     |  NULL   |       |
|    city    | varchar(20) | YES  |     |  NULL   |       |
| contact_no |     int     | YES  |     |  NULL   |       |

7. Enhance the size of the ‘city’ attribute by 5, in the location table.

In [ ]:
run("ALTER TABLE Location MODIFY city VARCHAR(25)")

|   Field    |    Type     | Null | Key | Default | Extra |
| :--------: | :---------: | :--: | :-: | :-----: | :---: |
|   loc_id   | varchar(10) | YES  |     |  NULL   |       |
|    city    | varchar(25) | YES  |     |  NULL   |       |
| contact_no |     int     | YES  |     |  NULL   |       |

8. Delete the contact_no attribute from the location table.

In [ ]:
run("ALTER TABLE Location DROP contact_no")

| Field  |    Type     | Null | Key | Default | Extra |
| :----: | :---------: | :--: | :-: | :-----: | :---: |
| loc_id | varchar(10) | YES  |     |  NULL   |       |
|  city  | varchar(25) | YES  |     |  NULL   |       |

9. Make the department attribute of the employee table its foreign key referencing the
   department table.

In [ ]:
run(
    """ALTER TABLE Employee ADD FOREIGN KEY (dept)
		   REFERENCES Department(d_name)
"""
)

|      Field      |    Type     | Null | Key | Default | Extra |
| :-------------: | :---------: | :--: | :-: | :-----: | :---: |
|     emp_id      |     int     |  NO  | PRI |  NULL   |       |
|     f_name      | varchar(25) |  NO  |     |  NULL   |       |
|     l_name      | varchar(25) | YES  |     |  NULL   |       |
|    job_type     | varchar(10) | YES  |     |  NULL   |       |
|     salary      |     int     |  NO  |     |  NULL   |       |
|      dept       | varchar(10) | YES  | MUL |  NULL   |       |
|   commission    |     int     | YES  |     |  NULL   |       |
|   manager_id    | varchar(5)  | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |
| date_of_joining |    date     | YES  |     |  NULL   |       |

10. Rename the city attribute to ‘address’ in the location table.

In [ ]:
run("ALTER TABLE Location RENAME COLUMN city TO address")

|  Field  |    Type     | Null | Key | Default | Extra |
| :-----: | :---------: | :--: | :-: | :-----: | :---: |
| loc_id  | varchar(10) | YES  |     |  NULL   |       |
| address | varchar(25) | YES  |     |  NULL   |       |

11. Rename the location table name to ‘loc’.

In [ ]:
run("RENAME TABLE Location TO Loc")

12. Insert the following rows in ‘loc’ table.

In [ ]:
run(
    """INSERT INTO Loc VALUES
				(1, 'Kolkata'),
				(2, 'Mumbai')
"""
)
connection.commit()

| loc_id | address |
| :----: | :-----: |
|   1    | Kolkata |
|   2    | Mumbai  |

13. Truncate the table ‘loc’.

In [ ]:
run("TRUNCATE TABLE Loc")

| loc_id | address |
| :----: | :-----: |

14. Drop the table ‘loc’.

In [ ]:
run("DROP TABLE Loc")

15. Insert the following rows in the department table:

In [ ]:
run(
    """INSERT INTO Department VALUES
				('Sales', 'Kol', 4),
				('Accounts', 'Delhi', 6),
				('Production', 'Kol', 1),
				('Marketing', 'Kol', 2),
				('R & D', 'Marketing', 8)

"""
)

| d_name     | d_loc     | HOD_id |
|:------------:|:-----------:|:--------:|
| Accounts   | Delhi     | 6      |
| Marketing  | Kol       | 2      |
| Production | Kol       | 1      |
| R & D      | Marketing | 8      |
| Sales      | Kol       | 4      |

16. Insert the following rows in the employee table.

In [ ]:
run(
    """INSERT INTO Employee (emp_id, f_name, l_name, job_type, salary, commission, dept, manager_id, date_of_joining) VALUES
			(1, 'Arun', 'Khan', 'Manager', 90000, 0, 'Production', NULL, '1998-01-04'),
			(2, 'Barun', 'Kumar', 'Manager', 80000, 0, 'Marketing', NULL, '1998-02-09'),
			(3, 'Chitra', 'Kapoor', 'Engineer', 60000, 0, 'Production', 1, '1998-01-08'),
			(10, 'Sunny', 'Deol', 'Salesman', 35000, 0, 'R & D', 8, '2017-10-17')

"""
)
connection.commit()

| emp_id | f_name | l_name | job_type | salary | dept       | commission | manager_id | date_of_joining |
|:--------:|:--------:|:--------:|:----------:|:--------:|:------------:|:------------:|:------------:|:-----------------:|
|      1 | Arun   | Khan   | Manager  |  90000 | Production |          0 | NULL       | 1998-01-04      |
|      2 | Barun  | Kumar  | Manager  |  80000 | Marketing  |          0 | NULL       | 1998-02-09      |
|      3 | Chitra | Kapoor | Engineer |  60000 | Production |          0 | 1          | 1998-01-08      |
|     10 | Sunny  | Deol   | Salesman |  35000 | R & D      |          0 | 8          | 2017-10-17      |

17. Show the values of departmental table.

In [ ]:
run("SELECT * FROM Department")
disp()

|   d_name   |   d_loc   | HOD_id |
| :--------: | :-------: | :----: |
|  Accounts  |   Delhi   |   6    |
| Marketing  |    Kol    |   2    |
| Production |    Kol    |   1    |
|   R & D    | Marketing |   8    |
|   Sales    |    Kol    |   4    |

18. Show the values of departmental table.

In [ ]:
run("SELECT d_name AS Name, d_loc AS Location FROM Department")
disp()

|    Name    | Location  |
| :--------: | :-------: |
|  Accounts  |   Delhi   |
| Marketing  |    Kol    |
| Production |    Kol    |
|   R & D    | Marketing |
|   Sales    |    Kol    |

19. Show the employees f_name , l_name , salary and the salary after 1000rs. Bonus.

In [ ]:
run("SELECT salary + 1000 AS 'Bonus Salary' FROM Employee")
disp()


| Bonus Salary |
|:-:|
|        91000 |
|        81000 |
|        61000 |
|        36000 |

20. Show the employees annual salary with a 1000rs. Yearly bonus and the annual salary 
with a 100rs. Monthly bonus.

In [ ]:
run("SELECT (salary + 100) * 12 + 1000 AS 'Annual Salary' FROM Employee")
disp()


| Annual Salary |
|:---------------:|
|       1082200 |
|        962200 |
|        722200 |
|        422200 |

21. Show f_name as NAME and annual salary as ANNSAL from the employee table.

In [ ]:
run("SELECT f_name AS NAME, salary * 12 AS ANNSAL from Employee")
disp()

| NAME   | ANNSAL  |
|:--------:|:---------:|
| Arun   | 1080000 |
| Barun  |  960000 |
| Chitra |  720000 |
| Sunny  |  420000 |

22. Show the l_name as LasT AND 100rs. Incremented salary as NewSal.

In [ ]:
run("SELECT l_name AS LasT, salary + 100 AS NewSal FROM Employee")
disp()

| LasT   | NewSal |
|:-:|:-:|
| Khan   |  90100 |
| Kumar  |  80100 |
| Kapoor |  60100 |
| Deol   |  35100 |

23. Show the emp_id, f_name, l_name, job_type of the employee getting highest salary.

In [13]:
run("""SELECT emp_id, f_name, l_name, job_type FROM Employee 
    WHERE salary = (SELECT MAX(salary) FROM Employee)
""")
disp()

(1, 'Arun', 'Khan', 'Manager', 90000)

| emp_id | f_name | l_name | job_type |
|:--------:|:--------:|:--------:|:----------:|
|      1 | Arun   | Khan   | Manager  |

24. Show the emp_id, f_name, l_name, job_type of the employee getting minimum salary.

In [15]:
run("""SELECT emp_id, f_name, l_name, job_type FROM Employee 
    WHERE salary = (SELECT MIN(salary) FROM Employee)
""")
disp()

(10, 'Sunny', 'Deol', 'Salesman')

| emp_id | f_name | l_name | job_type |
|:--------:|:--------:|:--------:|:----------:|
|      10 | Sunny   | Deol   | Salesman  |

25. Show the average salary of employees in the employee table.

In [17]:
run("SELECT AVG(salary) AS 'Average Salary' FROM Employee")
disp()

(Decimal('66250.0000'),)

| Average Salary |
|:----------------:|
|     66250.0000 |

26. Consider the Insurance database given below. The primary keys are underlined and the 
data types are specified:  
    - PERSON (driver-id: string, name: string, address: string)   
    - CAR (Regno:string,model:string,year:int)   
    - ACCIDENT (report-number:int,date:date,location:string)   
    - OWNS (driver-id:string,regno:string)   
    - PARTICIPATED (driver-id:string,regno:string,report-number:int,damage-amount:int)  
    i. Create the above tables by properly specifying the primary keys and the foreign keys  
   ii. Enter atleast five tuples for each relation  
  iii. Demonstrate how you a. Update the damage amount for the car with a specific regno in accident with report number 12 to 25000 b. Add a new accident to the database.  
   iv. Find the total number of people who owned cars that were involved in accidents in 2006.   
    v. Find the number of accidents in which cars belonging to a specific model were involved.

In [ ]:
run("")